УТ/src/DataProcessors/АУ_РедактированиеСтатейБюджетаВОплате/АУ_РедактированиеСтатейБюджетаВОплате.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>АУ_РедактированиеСтатейБюджетаВОплате</name>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаБюджета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическийКурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СтатьиБюджета</name>
    <attributes>
      <name>СтатьяБюджета</name>
      <type>
        <types>CatalogRef.АУ_СтатьиБюджета</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаБюджета</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Программа</name>
      <type>
        <types>CatalogRef.АУ_Программы</types>
      </type>
    </attributes>
    <attributes>
      <name>Объект</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерКонтракта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказКлиента</name>
      <type>
        <types>DocumentRef.ЗаказКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Шифр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакРасходов</name>
      <type>
        <types>CatalogRef.АУ_ПризнакРасходов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

УТ/src/DataProcessors/АУ_РедактированиеСтатейБюджетаВОплате/Forms/Форма/Module.bsl
&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	АУ_Привелигированный.ИзменитьСтатьиБюджетаВДокументе(Объект.Документ,Объект.СтатьиБюджета.Выгрузить(),Объект.ДатаБюджета,Объект.ФактическийКурсВалюты);
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	ЗаписатьНаСервере();
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеИзДокумента()
	
	Объект.СтатьиБюджета.Загрузить(Объект.Документ.АУ_СтатьиБюджета.Выгрузить());
	Объект.ДатаБюджета = Объект.Документ.АУ_ДатаБюджета;
	Объект.ФактическийКурсВалюты = Объект.Документ.АУ_ФактическийКурсВалюты;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Документ") Тогда
		
		Объект.Документ = Параметры.Документ;
		СуммаДокумента = Параметры.Документ.СуммаДокумента;
		
	КонецЕсли;
	
	ПрочитатьДанныеИзДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументПриИзменении(Элемент)
	
	ПрочитатьДанныеИзДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьиБюджетаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.Сумма = СуммаДокумента - Объект.СтатьиБюджета.Итог("Сумма");
	КонецЕсли;
	
КонецПроцедуры
